# Pandas 101

In [1]:
import numpy as np
import pandas as pd
print("NumPy Version: ", np.__version__)
print("Pandas Version: ", pd.__version__)

NumPy Version:  2.1.1
Pandas Version:  2.2.3

## Pandas Series

In [5]:
# Create pandas Series
ser1 = pd.Series([0.25, 0.5, 0.75, 1.0])
print("ser1: ", ser1)
print("Shape: ", ser1.shape)
print("Values:\n", ser1.values)
print("Index: ", ser1.index)

ser1:  0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
Shape:  (4,)
Values:
 [0.25 0.5  0.75 1.  ]
Index:  RangeIndex(start=0, stop=4, step=1)

In [6]:
# Index does not need to be an integer, can be values of any type
ser2 = pd.Series([0, 1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e", "f"])
ser2["e"]

np.int64(4)

In [7]:
# Pandas series can be thought of as serialization of Python dictionary
moto_prices_dict = { "BMV R1300GS":  23000, 
                    "Honda Africe Twin": 16000,
                    "Royal Enfield  Himalayan" : 4000 }
moto_prices = pd.Series(moto_prices_dict)
print(moto_prices)
print(type(moto_prices))

BMV R1300GS                 23000
Honda Africe Twin           16000
Royal Enfield  Himalayan     4000
dtype: int64
<class 'pandas.core.series.Series'>

## Pandas DataFrame

In [27]:
df = pd.DataFrame([[110, 2000, 35000],[100, 2500, 30000]])
df

     0     1      2
0  110  2000  35000
1  100  2500  30000

In [37]:
# DataFrame shape and values
print("Shape: ", df.shape)
print("Values:\n", df.values)

Shape:  (2, 3)
Values:
 [[  110  2000 35000]
 [  100  2500 30000]]

In [39]:
# Include Column Names
df = pd.DataFrame([[110, 2000, 35000],[100, 2500, 30000]], columns=["Top Speed", "Weight", "Price"])
df

   Top Speed  Weight  Price
0        110    2000  35000
1        100    2500  30000

In [40]:
# Include row/index names
df = pd.DataFrame([[110, 2000, 35000],[100, 2500, 30000]], columns=["Top Speed", "Weight", "Price"], index=["Car A", "Car B"])
df

       Top Speed  Weight  Price
Car A        110    2000  35000
Car B        100    2500  30000

In [41]:
# Print index
df.index

Index(['Car A', 'Car B'], dtype='object')

## Create dataframe from Pandas Series

In [11]:
# Create Pandas Series from Python Dictionary
population_dict = {
  "California": 38332521,
  "Texas": 26448193,
  "New York": 19651127,
  "Florida": 19552860,
  "Illinois": 12882135
}
population_series = pd.Series(population_dict)
print("Population Series:\n", population_series)
area_dict = {
    'California': 423967, 
    'Texas': 695662, 
    'New York': 141297,
    'Florida': 170312, 
    'Illinois': 149995
}
area_series = pd.Series(area_dict)
print("Area Series:\n", area_series)

Population Series:
 California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64
Area Series:
 California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [13]:
# Create a DataFrame by using the two prior seriesâ€¦
states_df = pd.DataFrame({'population': population_series, 'area': area_series})
states_df

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

## Create dataframe from Python Directory

In [8]:
population_dict = {
  "California": 38332521,
  "Texas": 26448193,
  "New York": 19651127,
  "Florida": 19552860,
  "Illinois": 12882135
}
area_dict = {
    'California': 423967, 
    'Texas': 695662, 
    'New York': 141297,
    'Florida': 170312, 
    'Illinois': 149995
}

In [44]:
# create from Python dictionary
weather_data = {
    'day' : ['5/1/2022', '5/2/2022','5/3/2022','5/4/2022','5/5/2022','5/6/2022'],
    'temperature' : [44,45,28,24,33,56],
    'windspeed' : [6,7,2,7,4,2],
    'event' : ['Rain','Sunny','Snow','Snow','Rain','Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow
3  5/4/2022           24          7   Snow
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

In [45]:
# Shape 
print("Shape: ", df.shape)
rows, cols = df.shape
print("Rows: ", rows)
print("Cols: ", cols)

Shape:  (6, 4)
Rows:  6
Cols:  4

## Print rows

In [46]:
df.head()

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow
3  5/4/2022           24          7   Snow
4  5/5/2022           33          4   Rain

In [47]:
df.head(2)

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny

In [48]:
df.tail(2)

        day  temperature  windspeed  event
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

In [49]:
# Rows 2-4
df[2:5]

        day  temperature  windspeed event
2  5/3/2022           28          2  Snow
3  5/4/2022           24          7  Snow
4  5/5/2022           33          4  Rain

In [50]:
# All rows
df[:]

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow
3  5/4/2022           24          7   Snow
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

## Print Columns

In [51]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [52]:
# Print individual column
df.day

0    5/1/2022
1    5/2/2022
2    5/3/2022
3    5/4/2022
4    5/5/2022
5    5/6/2022
Name: day, dtype: object

In [53]:
# or as accessing property in dictionary
df['day']

0    5/1/2022
1    5/2/2022
2    5/3/2022
3    5/4/2022
4    5/5/2022
5    5/6/2022
Name: day, dtype: object

In [54]:
#Print some of the columns
df[['event', 'day']]

   event       day
0   Rain  5/1/2022
1  Sunny  5/2/2022
2   Snow  5/3/2022
3   Snow  5/4/2022
4   Rain  5/5/2022
5  Sunny  5/6/2022

In [60]:
# types
print("Data Frame type: ", type(df))
print("Column type: ", type(df['event']))

Data Frame type:  <class 'pandas.core.frame.DataFrame'>
Column type:  <class 'pandas.core.series.Series'>

## Operations on Dataframes

In [62]:
weather_data = {
    'day' : ['5/1/2022', '5/2/2022','5/3/2022','5/4/2022','5/5/2022','5/6/2022'],
    'temperature' : [44,45,28,24,33,56],
    'windspeed' : [6,7,2,7,4,2],
    'event' : ['Rain','Sunny','Snow','Snow','Rain','Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow
3  5/4/2022           24          7   Snow
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

In [65]:
# Max, Min temperature
t_max = df['temperature'].max()
t_min = df['temperature'].min()
print("Max temp: ", t_max)
print("Min temp: ", t_min)

Max temp:  56
Min temp:  24

In [66]:
# Mean temperature
t_mean = df['temperature'].mean()
print("Mean temp: ", t_mean)

Mean temp:  38.333333333333336

In [67]:
# Describe
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     38.333333   4.666667
std      12.077527   2.338090
min      24.000000   2.000000
25%      29.250000   2.500000
50%      38.500000   5.000000
75%      44.750000   6.750000
max      56.000000   7.000000

In [114]:
# Info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [115]:
# Count unique values
df.value_counts()

day       temperature  windspeed  event
5/1/2022  44           6          Rain     1
5/2/2022  45           7          Sunny    1
5/3/2022  28           2          Snow     1
5/4/2022  24           7          Snow     1
5/5/2022  33           4          Rain     1
5/6/2022  56           2          Sunny    1
Name: count, dtype: int64

In [68]:
# Select certain rows with a criteria
df[df.temperature>=32]

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

In [69]:
# Find max tempearture row
df[df.temperature==df.temperature.max()]

        day  temperature  windspeed  event
5  5/6/2022           56          2  Sunny

In [26]:
df['day'][df.temperature==df.temperature.max()]

5    5/6/2022
Name: day, dtype: object

In [27]:
df[['day','temperature']][df.temperature==df.temperature.max()]

        day  temperature
5  5/6/2022           56

## Indexing

In [70]:
weather_data = {
    'day' : ['5/1/2022', '5/2/2022','5/3/2022','5/4/2022','5/5/2022','5/6/2022'],
    'temperature' : [44,45,28,24,33,56],
    'windspeed' : [6,7,2,7,4,2],
    'event' : ['Rain','Sunny','Snow','Snow','Rain','Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow
3  5/4/2022           24          7   Snow
4  5/5/2022           33          4   Rain
5  5/6/2022           56          2  Sunny

In [71]:
df.index

RangeIndex(start=0, stop=6, step=1)

### loc()

Label-based indexing: Access data using row and column labels.

Syntax: df.loc[row_label, column_label]

### iloc()

Integer-based indexing: Access data using integer positions (starting from 0).

Syntax: df.iloc[row_index, column_index]

In [91]:
print(df.loc[4])
print(type(df.loc[4]))

day            5/5/2022
temperature          33
windspeed             4
event              Rain
Name: 4, dtype: object
<class 'pandas.core.series.Series'>

In [92]:
df.loc[:,"event"]

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [93]:
df.reset_index()

   index       day  temperature  windspeed  event
0      0  5/1/2022           44          6   Rain
1      1  5/2/2022           45          7  Sunny
2      2  5/3/2022           28          2   Snow
3      3  5/4/2022           24          7   Snow
4      4  5/5/2022           33          4   Rain
5      5  5/6/2022           56          2  Sunny

In [98]:
# Second Row
df.iloc[1]

day            5/2/2022
temperature          45
windspeed             7
event             Sunny
Name: 1, dtype: object

In [99]:
# First 3 rows
df.iloc[0:3]

        day  temperature  windspeed  event
0  5/1/2022           44          6   Rain
1  5/2/2022           45          7  Sunny
2  5/3/2022           28          2   Snow

In [100]:
# specific column
df.iloc[1,2]

np.int64(7)

In [101]:
# specific cell using iloc()
print(df.iloc[1,2])
print(type(df.iloc[1,2]))
a = 3
print(a)
a += df.iloc[1,2]
print(a)

7
<class 'numpy.int64'>
3
10

In [104]:
# specific cell using loc()
print(df.loc[1,"windspeed"])
print(type(df.loc[1,"windspeed"]))
a = 3
print(a)
a += df.loc[1,"windspeed"]
print(a)

7
<class 'numpy.int64'>
3
10

In [105]:
# 1 row, 2 columns
print(df.iloc[0,2:4])
print(type(df.iloc[0,2:4]))

windspeed       6
event        Rain
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [106]:
# 2 rows, 2 columns
print(df.iloc[0:2,2:4])
print(type(df.iloc[0:2,2:4]))

   windspeed  event
0          6   Rain
1          7  Sunny
<class 'pandas.core.frame.DataFrame'>

### More loc() vs. iloc()

In [8]:
# Create DataFrame
df = pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=["California", "Nevada", "Oregon", "Washington"],
                  columns=["Col_1", "Col_2", "Col_3", "Col_4"])
print(df)

            Col_1  Col_2  Col_3  Col_4
California      0      1      2      3
Nevada          4      5      6      7
Oregon          8      9     10     11
Washington     12     13     14     15

In [14]:
# Access element using labels
print(df.loc["Nevada", ["Col_2", "Col_4"]])

Col_2    5
Col_4    7
Name: Nevada, dtype: int64

In [15]:
# Access elements using integer indexes
print(df.iloc[3, [3, 0, 2]])

Col_4    15
Col_1    12
Col_3    14
Name: Washington, dtype: int64

In [16]:
# Select all rows upto and including Oregon and column 4
print(df.loc[:"Oregon","Col_4"])

California     3
Nevada         7
Oregon        11
Name: Col_4, dtype: int64

In [17]:
# Select all rows with Col_3 value > 5
print(df.loc[:,:][df.Col_3 > 5])

            Col_1  Col_2  Col_3  Col_4
Nevada          4      5      6      7
Oregon          8      9     10     11
Washington     12     13     14     15

In [19]:
# Select rows and cols 1 and 4
print(df.iloc[[0, 3], [0,3]])

            Col_1  Col_4
California      0      3
Washington     12     15

In [21]:
# Select rows and cols 1 and 4
print(df.loc[["California", "Washington"], ["Col_1","Col_4"]])

            Col_1  Col_4
California      0      3
Washington     12     15

## Create dataframe from file

In [107]:
df2 = pd.read_csv("data/temperatures.csv")

In [108]:
df2

   1  5/1/2022  44  6   Rain
0  2  5/2/2022  45  7  Sunny
1  3  5/3/2022  28  2   Snow
2  4  5/4/2022  24  7   Snow
3  5  5/5/2022  33  4   Rain
4  6  5/6/2022  56  2  Sunny
5  7  5/7/2022  40  8   Rain
6  8  5/8/2022  36  0    Fog

In [109]:
# Prevent first line from becoming a header
df2 = pd.read_csv("data/temperatures.csv", header=None)
df2

   0         1   2  3      4
0  1  5/1/2022  44  6   Rain
1  2  5/2/2022  45  7  Sunny
2  3  5/3/2022  28  2   Snow
3  4  5/4/2022  24  7   Snow
4  5  5/5/2022  33  4   Rain
5  6  5/6/2022  56  2  Sunny
6  7  5/7/2022  40  8   Rain
7  8  5/8/2022  36  0    Fog

## Column Names and Index Column

In [110]:
df2

   0         1   2  3      4
0  1  5/1/2022  44  6   Rain
1  2  5/2/2022  45  7  Sunny
2  3  5/3/2022  28  2   Snow
3  4  5/4/2022  24  7   Snow
4  5  5/5/2022  33  4   Rain
5  6  5/6/2022  56  2  Sunny
6  7  5/7/2022  40  8   Rain
7  8  5/8/2022  36  0    Fog

In [111]:
# Set Column Names
df2.columns = ["id", "day", "temperature", "windspeed", "event"]
df2

   id       day  temperature  windspeed  event
0   1  5/1/2022           44          6   Rain
1   2  5/2/2022           45          7  Sunny
2   3  5/3/2022           28          2   Snow
3   4  5/4/2022           24          7   Snow
4   5  5/5/2022           33          4   Rain
5   6  5/6/2022           56          2  Sunny
6   7  5/7/2022           40          8   Rain
7   8  5/8/2022           36          0    Fog

In [112]:
# Set Index Column
df3 = df2.set_index("id")
df3

         day  temperature  windspeed  event
id
1   5/1/2022           44          6   Rain
2   5/2/2022           45          7  Sunny
3   5/3/2022           28          2   Snow
4   5/4/2022           24          7   Snow
5   5/5/2022           33          4   Rain
6   5/6/2022           56          2  Sunny
7   5/7/2022           40          8   Rain
8   5/8/2022           36          0    Fog

## Merging DataFrames

In [3]:
# Merge 2 DataFrames
df1 = pd.DataFrame(
    {'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']}
)
df2 = pd.DataFrame(
    {'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
    'hire_date': [2004, 2008, 2012, 2014]}
)
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [4]:
# Manipulating Data 
df3["years_of_service"] = 2024 - df3["hire_date"]
df3

  employee        group  hire_date  years_of_service
0      Bob   Accounting       2008                16
1     Jake  Engineering       2012                12
2     Lisa  Engineering       2004                20
3      Sue           HR       2014                10

## Deleting Rows and Columns

In [116]:
# Drop a row
df4 = df3.drop(2) 
df4

         day  temperature  windspeed  event
id
1   5/1/2022           44          6   Rain
3   5/3/2022           28          2   Snow
4   5/4/2022           24          7   Snow
5   5/5/2022           33          4   Rain
6   5/6/2022           56          2  Sunny
7   5/7/2022           40          8   Rain
8   5/8/2022           36          0    Fog

In [117]:
# Drop a column
df5 = df4.drop("windspeed", axis=1)   # Axis 0 for rows and 1 for columns
df5

         day  temperature  event
id
1   5/1/2022           44   Rain
3   5/3/2022           28   Snow
4   5/4/2022           24   Snow
5   5/5/2022           33   Rain
6   5/6/2022           56  Sunny
7   5/7/2022           40   Rain
8   5/8/2022           36    Fog

## Adding new Columns

In [118]:
# Prevent first line from becoming a header
df = pd.read_csv("data/temperatures.csv", header=None)
df

   0         1   2  3      4
0  1  5/1/2022  44  6   Rain
1  2  5/2/2022  45  7  Sunny
2  3  5/3/2022  28  2   Snow
3  4  5/4/2022  24  7   Snow
4  5  5/5/2022  33  4   Rain
5  6  5/6/2022  56  2  Sunny
6  7  5/7/2022  40  8   Rain
7  8  5/8/2022  36  0    Fog

In [119]:
# Set Column Names
df.columns = ["id", "day", "temperature", "windspeed", "event"]
df

   id       day  temperature  windspeed  event
0   1  5/1/2022           44          6   Rain
1   2  5/2/2022           45          7  Sunny
2   3  5/3/2022           28          2   Snow
3   4  5/4/2022           24          7   Snow
4   5  5/5/2022           33          4   Rain
5   6  5/6/2022           56          2  Sunny
6   7  5/7/2022           40          8   Rain
7   8  5/8/2022           36          0    Fog

In [120]:
df["humidity"] = [80, 20, 60, 62, 88, 15, 88, 95] 
df

   id       day  temperature  windspeed  event  humidity
0   1  5/1/2022           44          6   Rain        80
1   2  5/2/2022           45          7  Sunny        20
2   3  5/3/2022           28          2   Snow        60
3   4  5/4/2022           24          7   Snow        62
4   5  5/5/2022           33          4   Rain        88
5   6  5/6/2022           56          2  Sunny        15
6   7  5/7/2022           40          8   Rain        88
7   8  5/8/2022           36          0    Fog        95

## Add new Rows

In [121]:
# Transpose
df_t = df.T
df_t

,0,1,2,3,4,5,6,7
id,1,2,3,4,5,6,7,8
day,5/1/2022,5/2/2022,5/3/2022,5/4/2022,5/5/2022,5/6/2022,5/7/2022,5/8/2022
temperature,44,45,28,24,33,56,40,36
windspeed,6,7,2,7,4,2,8,0
event,Rain,Sunny,Snow,Snow,Rain,Sunny,Rain,Fog
humidity,80,20,60,62,88,15,88,95

In [122]:
# Add column to Transposed frame
df_t[8] = [8, "5/9/2022", 45, 9, "Rain", 85] 
df_t

,0,1,2,3,4,5,6,7,8
id,1,2,3,4,5,6,7,8,8
day,5/1/2022,5/2/2022,5/3/2022,5/4/2022,5/5/2022,5/6/2022,5/7/2022,5/8/2022,5/9/2022
temperature,44,45,28,24,33,56,40,36,45
windspeed,6,7,2,7,4,2,8,0,9
event,Rain,Sunny,Snow,Snow,Rain,Sunny,Rain,Fog,Rain
humidity,80,20,60,62,88,15,88,95,85

In [123]:
# Transpose again to get a frame with extra row
df = df_t.T
df

  id       day temperature windspeed  event humidity
0  1  5/1/2022          44         6   Rain       80
1  2  5/2/2022          45         7  Sunny       20
2  3  5/3/2022          28         2   Snow       60
3  4  5/4/2022          24         7   Snow       62
4  5  5/5/2022          33         4   Rain       88
5  6  5/6/2022          56         2  Sunny       15
6  7  5/7/2022          40         8   Rain       88
7  8  5/8/2022          36         0    Fog       95
8  8  5/9/2022          45         9   Rain       85

## Group By

Split the data, apply an aggregate function and then combine the result.

In [16]:
# Data Frame with 3 categories
df = pd.DataFrame({"category": ["A", "B", "C", "A", "B", "C"],
                   "data": range(6)}, columns=["category", "data"])
print("DataFrame:\n", df)

# Group by 'key'
df_grouped = df.groupby('category')
print("Grouped by 'category': ", df_grouped)
print("\nSums of values for each 'category'\n", df_grouped.sum())

DataFrame:
   category  data
0        A     0
1        B     1
2        C     2
3        A     3
4        B     4
5        C     5
Grouped by 'category':  <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000012B5E5ED410>

Sums of values for each 'category'
           data
category
A            3
B            5
C            7

## Cleaning Data

In [66]:
# Load cars dataset
df_cars = pd.read_csv("data/cars.csv")
df_cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [67]:
df_cars.describe()

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,397.000000,397.000000,397.000000,397.000000,397.000000,397.000000,397.000000
mean,23.515869,5.458438,193.532746,2970.261965,15.555668,75.994962,1.574307
std,7.825804,1.701577,104.379583,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.000000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,146.000000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [68]:
df_cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           397 non-null    float64
 1   cylinders     397 non-null    int64
 2   displacement  397 non-null    float64
 3   horsepower    397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.0+ KB

In [69]:
# Horsepower is read in as on object, why?
np.unique(df_cars["horsepower"])

array(['100', '102', '103', '105', '107', '108', '110', '112', '113',
       '115', '116', '120', '122', '125', '129', '130', '132', '133',
       '135', '137', '138', '139', '140', '142', '145', '148', '149',
       '150', '152', '153', '155', '158', '160', '165', '167', '170',
       '175', '180', '190', '193', '198', '200', '208', '210', '215',
       '220', '225', '230', '46', '48', '49', '52', '53', '54', '58',
       '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70',
       '71', '72', '74', '75', '76', '77', '78', '79', '80', '81', '82',
       '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93',
       '94', '95', '96', '97', '98', '?'], dtype=object)

In [37]:
# We had some missing values '?', read them in as NaN
df_cars = pd.read_csv("data/cars.csv", na_values=['?'])
np.unique(df_cars["horsepower"])

array([ 46.,  48.,  49.,  52.,  53.,  54.,  58.,  60.,  61.,  62.,  63.,
        64.,  65.,  66.,  67.,  68.,  69.,  70.,  71.,  72.,  74.,  75.,
        76.,  77.,  78.,  79.,  80.,  81.,  82.,  83.,  84.,  85.,  86.,
        87.,  88.,  89.,  90.,  91.,  92.,  93.,  94.,  95.,  96.,  97.,
        98., 100., 102., 103., 105., 107., 108., 110., 112., 113., 115.,
       116., 120., 122., 125., 129., 130., 132., 133., 135., 137., 138.,
       139., 140., 142., 145., 148., 149., 150., 152., 153., 155., 158.,
       160., 165., 167., 170., 175., 180., 190., 193., 198., 200., 208.,
       210., 215., 220., 225., 230.,  nan])

In [38]:
print("Dimensions: ", df_cars.shape)

Dimensions:  (397, 9)

In [39]:
# Drop NaNs
df_cars_clean = df.dropna()
print("Dimensions: ", df_cars_clean.shape)

Dimensions:  (392, 9)

In [40]:
# Boolean access
idx_5cyl = df_cars_clean["cylinders"] == 5
df_cars_clean[idx_5cyl]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
274,20.3,5,131.0,103.0,2830,15.9,78,2,audi 5000
297,25.4,5,183.0,77.0,3530,20.1,79,2,mercedes benz 300d
327,36.4,5,121.0,67.0,2950,19.9,80,2,audi 5000s (diesel)

In [41]:
df_cars_clean.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
      dtype='int64', length=392)

In [43]:
# Change the index from running number to name
df_cars_clean_re = df_cars_clean.set_index("name")
df_cars_clean_re

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin
name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,1
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,1
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,1
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,1
ford torino,17.0,8,302.0,140.0,3449,10.5,70,1
...,...,...,...,...,...,...,...,...
ford mustang gl,27.0,4,140.0,86.0,2790,15.6,82,1
vw pickup,44.0,4,97.0,52.0,2130,24.6,82,2
dodge rampage,32.0,4,135.0,84.0,2295,11.6,82,1
ford ranger,28.0,4,120.0,79.0,2625,18.6,82,1
chevy s-10,31.0,4,119.0,82.0,2720,19.4,82,1

In [44]:
df_cars_clean_re.index

Index(['chevrolet chevelle malibu', 'buick skylark 320', 'plymouth satellite',
       'amc rebel sst', 'ford torino', 'ford galaxie 500', 'chevrolet impala',
       'plymouth fury iii', 'pontiac catalina', 'amc ambassador dpl',
       ...
       'chrysler lebaron medallion', 'ford granada l', 'toyota celica gt',
       'dodge charger 2.2', 'chevrolet camaro', 'ford mustang gl', 'vw pickup',
       'dodge rampage', 'ford ranger', 'chevy s-10'],
      dtype='object', name='name', length=392)

In [45]:
# 'name' is now index, no longer a regular column
df_cars_clean_re.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin'],
      dtype='object')

In [46]:
rows = ['amc rebel sst', 'ford torino']
df_cars_clean_re.loc[rows]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin
name,,,,,,,,
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,1
ford torino,17.0,8,302.0,140.0,3449,10.5,70,1

In [47]:
# alternatively, retrieve rows with index
df_cars_clean_re.iloc[[3,4]]

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin
name,,,,,,,,
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,1
ford torino,17.0,8,302.0,140.0,3449,10.5,70,1

In [48]:
# Or retriev specific columns
df_cars_clean_re.iloc[:, [0,2,3]]

                            mpg  displacement  horsepower
name
chevrolet chevelle malibu  18.0         307.0       130.0
buick skylark 320          15.0         350.0       165.0
plymouth satellite         18.0         318.0       150.0
amc rebel sst              16.0         304.0       150.0
ford torino                17.0         302.0       140.0
...                         ...           ...         ...
ford mustang gl            27.0         140.0        86.0
vw pickup                  44.0          97.0        52.0
dodge rampage              32.0         135.0        84.0
ford ranger                28.0         120.0        79.0
chevy s-10                 31.0         119.0        82.0

[392 rows x 3 columns]

In [49]:
# Extract the 4th and 5th rows, as well as the 1st, 3rd and 4th columns, using a single call to iloc[]
df_cars_clean_re.iloc[[3,4], [0,2,3]]

                mpg  displacement  horsepower
name
amc rebel sst  16.0         304.0       150.0
ford torino    17.0         302.0       140.0

In [50]:
# Index entries need not be unique: there are several cars in the data with the same name
df_cars_clean_re.loc["ford galaxie 500", ["mpg", "origin"]]

                   mpg  origin
name
ford galaxie 500  15.0       1
ford galaxie 500  14.0       1
ford galaxie 500  14.0       1

### Indexex and lambda functions

In [52]:
idx_5cyl = df_cars_clean_re["cylinders"] == 5
print("idx_5cyl: ", idx_5cyl)
df_cars_clean_re.loc[idx_5cyl, ['weight', 'horsepower']]

idx_5cyl:  name
chevrolet chevelle malibu    False
buick skylark 320            False
plymouth satellite           False
amc rebel sst                False
ford torino                  False
                             ...
ford mustang gl              False
vw pickup                    False
dodge rampage                False
ford ranger                  False
chevy s-10                   False
Name: cylinders, Length: 392, dtype: bool

                     weight  horsepower
name
audi 5000              2830       103.0
mercedes benz 300d     3530        77.0
audi 5000s (diesel)    2950        67.0

In [70]:
# Same with a lambda function
df_cars_clean_re.loc[lambda df: df["cylinders"] == 5, ['weight', 'horsepower']]

                     weight  horsepower
name
audi 5000              2830       103.0
mercedes benz 300d     3530        77.0
audi 5000s (diesel)    2950        67.0

In [91]:
# more complex lambda function
df_cars_clean_re.loc[lambda df: (df['displacement'] < 100)
                       & (df.index.str.contains('ford')
                       | df.index.str.contains('datsun')),
            ['weight', 'origin']
           ]

                       weight  origin
name
datsun pl510             2130       3
datsun pl510             2130       3
datsun 1200              1613       3
datsun 510 (sw)          2288       3
datsun b210              1950       3
datsun 710               2003       3
datsun b-210             1990       3
datsun f-10 hatchback    1945       3
ford fiesta              1800       1
datsun b210 gx           2070       3
datsun 210               2020       3
datsun 310               2019       3
datsun 210               2110       3
datsun 210 mpg           1975       3
ford escort 4w           2045       1
ford escort 2h           2380       1
datsun 310 gx            1995       3